#ifndef LCD_H
#define LCD_H

#include <rgb_lcd.h>

extern rgb_lcd lcd;

//===========================================================//
//========================変数宣言============================//
//===========================================================//
extern bool g_timer_flag;    // タイマフラグ
extern bool g_flash_flag;    // フラッシュフラグ
extern bool g_lcd_flag;    // LCDフラッグ

//===========================================================//
//==================関数プロトタイプ宣言=======================//
//===========================================================//
void lcd_init();
void updateLCD(uint8_t status);

#endif // LCD_H
